In [102]:
import numpy as np
import pandas as pd

In [103]:
s = pd.Series([0, 25, 0.5, 0.75, 1.0])
s

0     0.00
1    25.00
2     0.50
3     0.75
4     1.00
dtype: float64

In [104]:
s.values # 시리즈 밸류만 보겠다

array([ 0.  , 25.  ,  0.5 ,  0.75,  1.  ])

In [105]:
s.index #Rangeindex => 범위로 되어 있음

RangeIndex(start=0, stop=5, step=1)

In [106]:
s = pd.Series([0, 25, 0.5, 0.75, 1.0], index=['a','b','c','d','e'])
s

a     0.00
b    25.00
c     0.50
d     0.75
e     1.00
dtype: float64

In [206]:
s1 = s.sort_index()
s1

0     0.00
1    25.00
2     0.50
3     0.75
4     1.00
dtype: float64

In [108]:
s[['c','e']] #원하는 인덱스 출력

c    0.5
e    1.0
dtype: float64

In [109]:
'b' in s

True

In [110]:
s = pd.Series([0, 25, 0.5, 0.75, 1.0], index=[2,4,6,8,10])
s

2      0.00
4     25.00
6      0.50
8      0.75
10     1.00
dtype: float64

In [111]:
s.unique()

array([ 0.  , 25.  ,  0.5 ,  0.75,  1.  ])

In [112]:
s.value_counts() #데이터 각각 몇 개인지

0.00     1
25.00    1
0.50     1
0.75     1
1.00     1
dtype: int64

In [113]:
s.isin([0.25,0.75]) # 원하는 인덱스가 어디있는지 bool로 표현

2     False
4     False
6     False
8      True
10    False
dtype: bool

In [114]:
pop_tuple = {'서울특별시':9720846, 
             '부산광역시':3404423,
             '인천광역시':2947217,
             '대구광역시':2427954,
             '대전광역시':1471040,
             '광주광역시':1455048}

population = pd.Series(pop_tuple)  #튜플 상태
population

서울특별시    9720846
부산광역시    3404423
인천광역시    2947217
대구광역시    2427954
대전광역시    1471040
광주광역시    1455048
dtype: int64

In [115]:
population['서울특별시':'인천광역시']

서울특별시    9720846
부산광역시    3404423
인천광역시    2947217
dtype: int64

In [116]:
#DataFrame  pd.DataFrame[{},{}] {}값 한행씩
pd.DataFrame([{'A':2, 'B':3, 'D':3}, {'A':4, 'B':5, 'C':7}])

   A  B    D    C
0  2  3  3.0  NaN
1  4  5  NaN  7.0

In [117]:
pd.DataFrame(np.random.rand(5,5), 
             columns=['A','B','C','D','E'],
             index=[1,2,3,4,5])

          A         B         C         D         E
1  0.060056  0.076543  0.811284  0.607938  0.903696
2  0.513627  0.117534  0.640613  0.749188  0.808981
3  0.075908  0.026517  0.090207  0.514994  0.806837
4  0.270695  0.560867  0.082219  0.252053  0.707001
5  0.271374  0.103122  0.437657  0.454572  0.954922

In [159]:
male_tuple = {'서울특별시':4732250, 
             '부산광역시':1668618,
             '인천광역시':1476813,
             '대구광역시':1198815,
             '대전광역시':734441,
             '광주광역시':720060}
male = pd.Series(male_tuple)
male

서울특별시    4732250
부산광역시    1668618
인천광역시    1476813
대구광역시    1198815
대전광역시     734441
광주광역시     720060
dtype: int64

In [161]:
female_tuple = {'서울특별시':4988571, 
             '부산광역시':1735805,
             '인천광역시':1470404,
             '대구광역시':1229139,
             '대전광역시':736559,
             '광주광역시':734988}
female = pd.Series(female_tuple)
female

서울특별시    4988571
부산광역시    1735805
인천광역시    1470404
대구광역시    1229139
대전광역시     736559
광주광역시     734988
dtype: int64

In [162]:
korea_df = pd.DataFrame({'인구수' : population,
                         '남자인구수' : male,
                         '여자인구수' : female})
korea_df

           인구수    남자인구수    여자인구수
서울특별시  9720846  4732250  4988571
부산광역시  3404423  1668618  1735805
인천광역시  2947217  1476813  1470404
대구광역시  2427954  1198815  1229139
대전광역시  1471040   734441   736559
광주광역시  1455048   720060   734988

In [154]:
korea_df.index

Index(['서울특별시', '부산광역시', '인천광역시', '대구광역시', '대전광역시', '광주광역시'], dtype='object')

In [155]:
korea_df.columns

Index(['인구수', '남자인구수', '여자인구수'], dtype='object')

In [156]:
korea_df['여자인구수']

서울특별시     473225
부산광역시    1668618
인천광역시    1476813
대구광역시    1198815
대전광역시     734441
광주광역시     720060
Name: 여자인구수, dtype: int64

In [124]:
korea_df['서울특별시':'인천광역시'] #인덱스 슬라이싱 가능
                                    #컬럼 슬라이싱 불가

           인구수    남자인구수    여자인구수
서울특별시  9720846   473225   473225
부산광역시  3404423  1668618  1668618
인천광역시  2947217  1476813  1476813

In [125]:
# index 객체
idx = pd.Index([2, 4, 6, 8, 10])
idx

Int64Index([2, 4, 6, 8, 10], dtype='int64')

In [126]:
idx[1]

4

In [127]:
idx[1:2:2]     #[a:b:2] a~b까지 2스텝으로

Int64Index([4], dtype='int64')

In [128]:
idx[-1::]

Int64Index([10], dtype='int64')

In [129]:
print(idx)
print(idx.size)
print(idx.shape) #(5,) 1차원 shape을 가짐

Int64Index([2, 4, 6, 8, 10], dtype='int64')
5
(5,)

In [130]:
idx1 = pd.Index([1,2,4,6,8])
idx2 = pd.Index([2,4,5,6,7])
print(idx1.append(idx2))

Int64Index([1, 2, 4, 6, 8, 2, 4, 5, 6, 7], dtype='int64')

In [131]:
idx1

Int64Index([1, 2, 4, 6, 8], dtype='int64')

In [132]:
s = pd.Series([0, 0.25, 0.5, 0.75, 1.0])
s

0    0.00
1    0.25
2    0.50
3    0.75
4    1.00
dtype: float64

In [133]:
s.keys

<bound method Series.keys of 0    0.00
1    0.25
2    0.50
3    0.75
4    1.00
dtype: float64>

In [134]:
list(s.items())

[(0, 0.0), (1, 0.25), (2, 0.5), (3, 0.75), (4, 1.0)]

In [135]:
s['f'] = 1.25
s

0    0.00
1    0.25
2    0.50
3    0.75
4    1.00
f    1.25
dtype: float64

In [136]:
s[1:3]

1    0.25
2    0.50
dtype: float64

In [137]:
s[(s>0.4) & (s<0.8)]

2    0.50
3    0.75
dtype: float64

In [138]:
s = pd.Series([0, 25, 0.5, 0.75, 1.0])
s

0     0.00
1    25.00
2     0.50
3     0.75
4     1.00
dtype: float64

In [139]:
s.reindex(range(10))

0     0.00
1    25.00
2     0.50
3     0.75
4     1.00
5      NaN
6      NaN
7      NaN
8      NaN
9      NaN
dtype: float64

In [140]:
s.reindex(range(10), method = 'bfill')

0     0.00
1    25.00
2     0.50
3     0.75
4     1.00
5      NaN
6      NaN
7      NaN
8      NaN
9      NaN
dtype: float64

In [165]:
#DF 인뎅싱
korea_df

           인구수    남자인구수    여자인구수        남여비율
서울특별시  9720846  4732250  4988571   94.861835
부산광역시  3404423  1668618  1735805   96.129346
인천광역시  2947217  1476813  1470404  100.435867
대구광역시  2427954  1198815  1229139   97.532907
대전광역시  1471040   734441   736559   99.712447
광주광역시  1455048   720060   734988   97.968946

In [142]:
korea_df['남자인구수']

서울특별시     473225
부산광역시    1668618
인천광역시    1476813
대구광역시    1198815
대전광역시     734441
광주광역시     720060
Name: 남자인구수, dtype: int64

In [143]:
korea_df.여자인구수

서울특별시     473225
부산광역시    1668618
인천광역시    1476813
대구광역시    1198815
대전광역시     734441
광주광역시     720060
Name: 여자인구수, dtype: int64

In [164]:
korea_df['남여비율'] = (korea_df['남자인구수'] *100 
                    / korea_df['여자인구수'])

In [145]:
korea_df.남여비율

서울특별시    100.0
부산광역시    100.0
인천광역시    100.0
대구광역시    100.0
대전광역시    100.0
광주광역시    100.0
Name: 남여비율, dtype: float64

In [146]:
korea_df.values

array([[9.720846e+06, 4.732250e+05, 4.732250e+05, 1.000000e+02],
       [3.404423e+06, 1.668618e+06, 1.668618e+06, 1.000000e+02],
       [2.947217e+06, 1.476813e+06, 1.476813e+06, 1.000000e+02],
       [2.427954e+06, 1.198815e+06, 1.198815e+06, 1.000000e+02],
       [1.471040e+06, 7.344410e+05, 7.344410e+05, 1.000000e+02],
       [1.455048e+06, 7.200600e+05, 7.200600e+05, 1.000000e+02]])

In [147]:
korea_df.T

           서울특별시      부산광역시      인천광역시      대구광역시      대전광역시      광주광역시
인구수    9720846.0  3404423.0  2947217.0  2427954.0  1471040.0  1455048.0
남자인구수   473225.0  1668618.0  1476813.0  1198815.0   734441.0   720060.0
여자인구수   473225.0  1668618.0  1476813.0  1198815.0   734441.0   720060.0
남여비율       100.0      100.0      100.0      100.0      100.0      100.0

In [148]:
korea_df.loc[:'인천광역시',:'남자인구수']

           인구수    남자인구수
서울특별시  9720846   473225
부산광역시  3404423  1668618
인천광역시  2947217  1476813

In [149]:
korea_df.loc[(korea_df.여자인구수>1000000)]

           인구수    남자인구수    여자인구수   남여비율
부산광역시  3404423  1668618  1668618  100.0
인천광역시  2947217  1476813  1476813  100.0
대구광역시  2427954  1198815  1198815  100.0

In [166]:
# 다중 인덱스
korea_df

           인구수    남자인구수    여자인구수        남여비율
서울특별시  9720846  4732250  4988571   94.861835
부산광역시  3404423  1668618  1735805   96.129346
인천광역시  2947217  1476813  1470404  100.435867
대구광역시  2427954  1198815  1229139   97.532907
대전광역시  1471040   734441   736559   99.712447
광주광역시  1455048   720060   734988   97.968946

In [174]:
idx_tuples = [('서울특별시',2010), ('서울특별시',2020),
              ('부산광역시',2010), ('부산광역시',2020),
              ('인천광역시',2010), ('인천광역시',2020),
              ('대구광역시',2010), ('대구광역시',2020),
              ('대전광역시',2010), ('대전광역시',2020),
              ('광주광역시',2010), ('광주광역시',2020)]
idx_tuples

[('서울특별시', 2010),
 ('서울특별시', 2020),
 ('부산광역시', 2010),
 ('부산광역시', 2020),
 ('인천광역시', 2010),
 ('인천광역시', 2020),
 ('대구광역시', 2010),
 ('대구광역시', 2020),
 ('대전광역시', 2010),
 ('대전광역시', 2020),
 ('광주광역시', 2010),
 ('광주광역시', 2020)]

In [176]:
pop_tuples = [10312545, 9720846,
              2567910, 3404423,
              2758296, 2947217,
              2511676, 2427954,
              1503663, 1471040,
              1454636, 1455048]
population = pd.Series(pop_tuples, index=idx_tuples)
population

(서울특별시, 2010)    10312545
(서울특별시, 2020)     9720846
(부산광역시, 2010)     2567910
(부산광역시, 2020)     3404423
(인천광역시, 2010)     2758296
(인천광역시, 2020)     2947217
(대구광역시, 2010)     2511676
(대구광역시, 2020)     2427954
(대전광역시, 2010)     1503663
(대전광역시, 2020)     1471040
(광주광역시, 2010)     1454636
(광주광역시, 2020)     1455048
dtype: int64

In [178]:
midx = pd.MultiIndex.from_tuples(idx_tuples)
midx

MultiIndex([('서울특별시', 2010),
            ('서울특별시', 2020),
            ('부산광역시', 2010),
            ('부산광역시', 2020),
            ('인천광역시', 2010),
            ('인천광역시', 2020),
            ('대구광역시', 2010),
            ('대구광역시', 2020),
            ('대전광역시', 2010),
            ('대전광역시', 2020),
            ('광주광역시', 2010),
            ('광주광역시', 2020)],
           )

In [179]:
population = population.reindex(midx)
population

서울특별시  2010    10312545
       2020     9720846
부산광역시  2010     2567910
       2020     3404423
인천광역시  2010     2758296
       2020     2947217
대구광역시  2010     2511676
       2020     2427954
대전광역시  2010     1503663
       2020     1471040
광주광역시  2010     1454636
       2020     1455048
dtype: int64

In [180]:
population[:, 2010]

서울특별시    10312545
부산광역시     2567910
인천광역시     2758296
대구광역시     2511676
대전광역시     1503663
광주광역시     1454636
dtype: int64

In [181]:
population['대전광역시', :]

2010    1503663
2020    1471040
dtype: int64

In [182]:
korea_mdf = population.unstack() #unstack 일반적인 DF로 변환
korea_mdf

           2010     2020
광주광역시   1454636  1455048
대구광역시   2511676  2427954
대전광역시   1503663  1471040
부산광역시   2567910  3404423
서울특별시  10312545  9720846
인천광역시   2758296  2947217

In [183]:
korea_mdf.stack()

광주광역시  2010     1454636
       2020     1455048
대구광역시  2010     2511676
       2020     2427954
대전광역시  2010     1503663
       2020     1471040
부산광역시  2010     2567910
       2020     3404423
서울특별시  2010    10312545
       2020     9720846
인천광역시  2010     2758296
       2020     2947217
dtype: int64

In [187]:
male_tuples = [5111259, 4732275, 1773170, 1668618,
              1490356, 1476813, 1255245, 1198815,
              753648, 734441,
              721780, 720060]
male_tuples

[5111259,
 4732275,
 1773170,
 1668618,
 1490356,
 1476813,
 1255245,
 1198815,
 753648,
 734441,
 721780,
 720060]

In [188]:
korea_mdf = pd.DataFrame({'총인구수':population, '남자인구수':male_tuples})
korea_mdf

                총인구수    남자인구수
서울특별시 2010  10312545  5111259
      2020   9720846  4732275
부산광역시 2010   2567910  1773170
      2020   3404423  1668618
인천광역시 2010   2758296  1490356
      2020   2947217  1476813
대구광역시 2010   2511676  1255245
      2020   2427954  1198815
대전광역시 2010   1503663   753648
      2020   1471040   734441
광주광역시 2010   1454636   721780
      2020   1455048   720060

In [193]:
female_tuples = [5201286, 4988571,
                 1794740, 1735805,
                 1367940, 129139,
                 750016, 736599,
                 732856, 734988]
female_tuples

[5201286,
 4988571,
 1794740,
 1735805,
 1367940,
 129139,
 750016,
 736599,
 732856,
 734988]

In [195]:
df = pd.DataFrame(np.random.rand(6, 3),
                 index=[['a','a','b','b','c','c'], [1,2,1,2,1,2]],
                 columns=['c1','c2','c3'])
df

           c1        c2        c3
a 1  0.893713  0.793930  0.000135
  2  0.079023  0.520227  0.311574
b 1  0.047745  0.335046  0.130200
  2  0.610322  0.284105  0.696271
c 1  0.144411  0.330750  0.766601
  2  0.439214  0.198952  0.428464

In [199]:
pd.MultiIndex.from_arrays([['a','a','b','b','c','c'], [1,2,1,2,1,2]])

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2),
            ('c', 1),
            ('c', 2)],
           )

In [201]:
pd.MultiIndex.from_tuples([('a',1),('a',2)])

MultiIndex([('a', 1),
            ('a', 2)],
           )

In [203]:
population.index.names = ['행정구역', '년도']
population

행정구역   년도
서울특별시  2010    10312545
       2020     9720846
부산광역시  2010     2567910
       2020     3404423
인천광역시  2010     2758296
       2020     2947217
대구광역시  2010     2511676
       2020     2427954
대전광역시  2010     1503663
       2020     1471040
광주광역시  2010     1454636
       2020     1455048
dtype: int64

In [207]:
s = pd.Series(np.random.randint(0, 10, 5))
s

0    7
1    2
2    2
3    2
4    5
dtype: int32

In [208]:
df = pd.DataFrame(np.random.randint(0,10,(3,3)),
                 columns=['A','B','C'])
df

   A  B  C
0  3  0  7
1  5  6  7
2  7  7  2

In [209]:
np.exp(s)

0    1096.633158
1       7.389056
2       7.389056
3       7.389056
4     148.413159
dtype: float64

In [210]:
np.cos(df * np.pi /4)

          A             B             C
0 -0.707107  1.000000e+00  7.071068e-01
1 -0.707107 -1.836970e-16  7.071068e-01
2  0.707107  7.071068e-01  6.123234e-17

In [212]:
s1 = pd.Series([1, 3, 5, 7, 9], index=[0,1,2,3,4])
s2 = pd.Series([2, 4, 6, 8, 10], index=[1,2,3,4,5])
s1 + s2 # 인덱스 기준

0     NaN
1     5.0
2     9.0
3    13.0
4    17.0
5     NaN
dtype: float64

In [213]:
s1.add(s2, fill_value=0)

0     1.0
1     5.0
2     9.0
3    13.0
4    17.0
5    10.0
dtype: float64

In [215]:
df1 = pd.DataFrame(np.random.randint(0, 20, (3,3)),
                  columns=list('ACD'))
df1

    A   C   D
0  19   0   5
1   3  19  12
2  16   6   9

In [217]:
df2 = pd.DataFrame(np.random.randint(0, 20, (5,5)),
                  columns=list('BAECD'))
df2

    B   A  E   C   D
0  15   3  3  11  17
1  15   7  4  18   6
2   3   6  2   6   5
3  15  17  5  11  17
4   4  13  2  16   2

In [221]:
fvalue = df1.stack().mean()
df1.add(df2, fill_value=fvalue)

           A          B          C          D          E
0  22.000000  24.888889  11.000000  22.000000  12.888889
1  10.000000  24.888889  37.000000  18.000000  13.888889
2  22.000000  12.888889  12.000000  14.000000  11.888889
3  26.888889  24.888889  20.888889  26.888889  14.888889
4  22.888889  13.888889  25.888889  11.888889  11.888889

In [223]:
a = np.random.randint(1, 10, size=(3,3))
a

array([[3, 8, 4],
       [2, 7, 1],
       [6, 9, 4]])

In [224]:
a + a[0]

array([[ 6, 16,  8],
       [ 5, 15,  5],
       [ 9, 17,  8]])

In [225]:
df = pd.DataFrame(a, columns=list('ABC'))
df

   A  B  C
0  3  8  4
1  2  7  1
2  6  9  4

In [226]:
df + df.iloc[0]

   A   B  C
0  6  16  8
1  5  15  5
2  9  17  8

In [227]:
df.add(df.iloc[0])

   A   B  C
0  6  16  8
1  5  15  5
2  9  17  8

In [228]:
a

array([[3, 8, 4],
       [2, 7, 1],
       [6, 9, 4]])

In [229]:
a - a[0]

array([[ 0,  0,  0],
       [-1, -1, -3],
       [ 3,  1,  0]])

In [230]:
df.sub(df.iloc[0])

   A  B  C
0  0  0  0
1 -1 -1 -3
2  3  1  0

In [233]:
df.subtract(df['B'], axis=0) #axix=0 열

   A  B  C
0 -5  0 -4
1 -5  0 -6
2 -3  0 -5

In [234]:
a ** a[0]

array([[      27, 16777216,      256],
       [       8,  5764801,        1],
       [     216, 43046721,      256]], dtype=int32)

In [235]:
df.pow(df.iloc[0])

     A         B    C
0   27  16777216  256
1    8   5764801    1
2  216  43046721  256

In [236]:
s = pd.Series(range(5), index=['A','D','B','C','E'])

In [237]:
s

A    0
D    1
B    2
C    3
E    4
dtype: int64

In [238]:
s.sort_index

<bound method Series.sort_index of A    0
D    1
B    2
C    3
E    4
dtype: int64>

In [239]:
s.sort_values  # axis = 1 -- 행 0 : 열

<bound method Series.sort_values of A    0
D    1
B    2
C    3
E    4
dtype: int64>

In [242]:
s = pd.Series([-2, 4, 7, 3, 0, 7, 3, 2])
s.rank()

0    1.0
1    6.0
2    7.5
3    4.5
4    2.0
5    7.5
6    4.5
7    3.0
dtype: float64

In [241]:
s.rank(method = 'first')

0    1.0
1    6.0
2    7.0
3    4.0
4    2.0
5    8.0
6    5.0
7    3.0
dtype: float64

In [ ]:
nrows, ncols = 100000, 100
df1, df2, df3, df4 = (pd.DataFrame(np.random.rand(nrows,ncols))
                      for i in range(4))